Revit 2023 API
GroupTypeId.EnergyAnalysisDetailedModel Property
 "Detailed Model"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisDetailedModel { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisDetailedModel As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisDetailedModel {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace